app/views/twits/index.html.erb

		<% if twit.profile_photo_id %>
			<% photo = Photo.find(twit.profile_photo_id) rescue photo = nil %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 6]]