app/views/albums/index.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 1 ORDER BY created_at DESC LIMIT 1
---
<% @albums.each do |album| %>
  <% photo = album.photos.order("created_at").last %>