app/views/albums/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 1
---

<% @album.photos.each do |photo| %>