app/views/photos/_form.html.erb

SELECT "albums".* FROM "albums"
---
    <%= f.label :album %><br />
    <%= f.collection_select :album_id, Album.all, :id, :title %>