app/views/photos/index.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = 1
---
<% @albums.each do |album| %>
  <% photos = Photo.find_all_by_album_id(album.id) %>