app/controllers/albums_controller.rb

  def index
	@albums = Album.find_all_by_twit_id(params[:view_id])
	@twit = Twit.find(params[:view_id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."twit_id" = 'view_id' LIMIT 1
SELECT "twits".* FROM "twits" WHERE "twits"."id" = ? LIMIT 1  [["id", 1]]

  def create

    @album = Album.new(params[:album])
	@album.twit_id = session[:twit_id]

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("created_at", "title", "twit_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 13 Apr 2013 21:26:49 UTC +00:00], ["title", "My first album"], ["twit_id", nil], ["updated_at", Sat, 13 Apr 2013 21:26:49 UTC +00:00]]

  def update
    @album = Album.find(params[:id])

    respond_to do |format|
      if @album.update_attributes(params[:album])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "albums" SET "title" = 'Hello album!!!', "updated_at" = '2013-04-15 17:07:43.020000' WHERE "albums"."id" = 2