app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("comment", "created_at", "twit_id", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "Hey josh!"], ["created_at", Sun, 28 Apr 2013 18:09:49 UTC +00:00], ["twit_id", nil], ["updated_at", Sun, 28 Apr 2013 18:09:49 UTC +00:00]]