app/controllers/photos_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."twit_id" IS NULL
---
  def index
    @albums = Album.find_all_by_twit_id(params[:view_id])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @photo = Photo.find(params[:id])
	@album = Album.find(@photo.album_id)

SELECT "albums".* FROM "albums" WHERE "albums"."twit_id" = 1 LIMIT 1
---
  def new
    @photo = Photo.new
	@albums = Album.find_all_by_twit_id(params[:view_id])

SELECT "twits".* FROM "twits" WHERE "twits"."id" = ? LIMIT 1  [["id", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "twits" SET "profile_photo_id" = 1, "updated_at" = '2013-04-15 17:46:42.798000' WHERE "twits"."id" = 1
---
  def edit
    @twit = Twit.find(params[:view_id])
	@photo = Photo.find(params[:id])
	@twit.profile_photo_id = @photo.id
	@twit.save

INSERT INTO "photos" ("album_id", "created_at", "picture_content_type", "picture_file_name", "picture_file_size", "picture_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 2]]
---
  def destroy
    @photo = Photo.find(params[:id])
	@album = Album.find(@photo.album_id)
    @photo.destroy