app/controllers/twits_controller.rb

SELECT "twits".* FROM "twits"
---
  def index
    @twits = Twit.all

SELECT "twits".* FROM "twits" WHERE "twits"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."twit_id" = 1
---
  def show
    @twit = Twit.find(params[:id])
	if @twit.profile_photo_id
		@photo = Photo.find(@twit.profile_photo_id)
	end
	@comments = Comment.find_all_by_twit_id(params[:id])

SELECT "twits".* FROM "twits" WHERE "twits"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @twit = Twit.find(params[:id])

INSERT INTO "twits" ("created_at", "first_name", "last_name", "password_hash", "password_salt", "profile_photo_content_type", "profile_photo_file_name", "profile_photo_file_size", "profile_photo_updated_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @twit = Twit.new(params[:twit])

    respond_to do |format|
      if @twit.save

SELECT "twits".* FROM "twits" WHERE "twits"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "twits" SET "photo_file_name" = 'I_am_a_nerd.jpg', "photo_content_type" = 'image/jpeg', "photo_file_size" = 0, "photo_updated_at" = '2013-04-01 15:58:10.857600', "updated_at" = '2013-04-01 15:58:10.858600' WHERE "twits"."id" = 1
---
  def update
    @twit = Twit.find(params[:id])

    respond_to do |format|
      if @twit.update_attributes(params[:twit])